app/views/messages/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    <% if message.body %>
      <% user = User.find(message.user_id) %>