app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
INSERT INTO "comments" ("name", "body", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "bm"], ["body", "nm"], ["post_id", 7], ["created_at", "2017-12-18 05:57:59.821304"], ["updated_at", "2017-12-18 05:57:59.821304"]]
---
def create
	# find posts with respect to post id and create a comment
	@post = Post.find(params[:post_id])
    @comment = @post.comments.create(params[:comment].permit(:name, :body))

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["post_id", 8], ["id", 3], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 3]]
---
def destroy
	# find posts with respect to post id and destroy comments
	@post = Post.find(params[:post_id])
	@comment = @post.comments.find(params[:id])
	@comment.destroy