app/controllers/messages_controller.rb

 def index
 	@messages = @conversation.messages
 	  if @messages.length > 10
---
SELECT "messages".* FROM "messages" WHERE "messages"."conversation_id" = $1  [["conversation_id", 1]]

    def create
    	@message = @conversation.messages.new(message_params)
    	if @message.save
---
INSERT INTO "messages" ("body", "conversation_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "hi frm a"], ["conversation_id", 1], ["user_id", 1], ["created_at", "2018-01-02 15:28:43.059844"], ["updated_at", "2018-01-02 15:28:43.059844"]]